[
    {
        "id": "clean_city_mission",
        "title": "Misi Bersih Kota Sinar",
        "start": {
          "text": "Anda adalah seorang petugas baru di Badan Narkotika Kota (BNK) Sinar, sebuah kota di provinsi Lampung. Kota ini sedang menghadapi masalah serius dengan peredaran narkoba. Kepala BNK memberi Anda misi pertama. Apa yang akan Anda lakukan?",
          "options": [
            {"text": "Lakukan penyelidikan di daerah rawan narkoba", "next": "investigate_hotspots"},
            {"text": "Mulai program edukasi di sekolah-sekolah", "next": "start_education_program"},
            {"text": "Koordinasi dengan kepolisian setempat", "next": "coordinate_with_police"}
          ]
        },
        "nodes": {
          "investigate_hotspots": {
            "text": "Anda mengidentifikasi beberapa titik rawan peredaran narkoba di Kota Sinar. Salah satunya adalah sebuah klub malam bernama 'Melody'.",
            "options": [
              {"text": "Lakukan pengintaian di klub Melody", "next": "stake_out_club"},
              {"text": "Rekrut informan dari dalam klub", "next": "recruit_informant"},
              {"text": "Ajukan surat perintah penggeledahan", "next": "request_warrant"}
            ]
          },
          "stake_out_club": {
            "text": "Pengintaian Anda berhasil. Anda mengumpulkan bukti kuat tentang operasi narkoba di klub dan menangkap para pelaku utama. Kota Sinar menjadi lebih aman berkat upaya Anda.",
            "end": true,
            "win": true
          },
          "recruit_informant": {
            "text": "Informan yang Anda rekrut ternyata double agent. Dia membocorkan rencana Anda ke bandar narkoba. Misi Anda gagal dan identitas Anda terungkap.",
            "end": true,
            "win": false
          },
          "request_warrant": {
            "text": "Proses birokrasi memakan waktu terlalu lama. Ketika Anda akhirnya mendapatkan surat perintah, bandar narkoba sudah menghilang. Operasi gagal.",
            "end": true,
            "win": false
          },
          "start_education_program": {
            "text": "Program edukasi Anda berjalan dengan baik, tapi hasilnya lambat. Sementara itu, peredaran narkoba terus meningkat. BNK menilai pendekatan Anda kurang efektif.",
            "end": true,
            "win": false
          },
          "coordinate_with_police": {
            "text": "Koordinasi dengan kepolisian menghasilkan operasi besar-besaran. Banyak bandar narkoba tertangkap, tapi beberapa berhasil melarikan diri.",
            "options": [
              {"text": "Fokus pada penangkapan bandar yang melarikan diri", "next": "chase_escapees"},
              {"text": "Tingkatkan keamanan kota untuk mencegah masuknya narkoba baru", "next": "increase_security"}
            ]
          },
          "chase_escapees": {
            "text": "Pengejaran intensif membuat Anda lalai terhadap aspek lain. Bandar baru muncul dan situasi kembali memburuk.",
            "end": true,
            "win": false
          },
          "increase_security": {
            "text": "Peningkatan keamanan berhasil mencegah masuknya narkoba baru, tapi beberapa bandar masih bebas. Kota lebih aman, tapi belum sepenuhnya bersih.",
            "end": true,
            "win": false
          }
        }
      },
      {
        "id": "mpl_id_journey",
        "title": "Road to Glory: Squad MIND di MPL ID",
        "start": {
          "text": "Anda adalah kapten Squad MIND, tim underdog yang baru saja lolos ke MPL ID. Turnamen akan dimulai dalam sebulan, dan tim Anda harus mempersiapkan diri. Apa langkah pertama Anda?",
          "options": [
            {"text": "Fokus pada latihan intensif", "next": "intensive_training"},
            {"text": "Rekrut pemain baru untuk memperkuat tim", "next": "recruit_new_player"},
            {"text": "Analisis strategi tim-tim top", "next": "analyze_top_teams"}
          ]
        },
        "nodes": {
          "intensive_training": {
            "text": "Tim berlatih keras selama seminggu. Kemampuan meningkat, tapi ada tanda-tanda burnout. Salah satu pemain mulai sering terlambat latihan.",
            "options": [
              {"text": "Bicarakan masalah dengan pemain tersebut", "next": "talk_to_player"},
              {"text": "Sesuaikan jadwal latihan", "next": "adjust_schedule"},
              {"text": "Tetap pertahankan intensitas latihan", "next": "maintain_intensity"}
            ]
          },
          "talk_to_player": {
            "text": "Diskusi Anda berhasil. Pemain tersebut merasa dihargai dan kembali berkomitmen. Tim menjadi lebih solid dan berhasil mencapai grand final MPL ID, memenangkan turnamen!",
            "end": true,
            "win": true
          },
          "adjust_schedule": {
            "text": "Jadwal baru memberi lebih banyak waktu istirahat. Tim lebih segar, tapi kurang siap menghadapi intensitas turnamen. MIND tersingkir di fase grup.",
            "end": true,
            "win": false
          },
          "maintain_intensity": {
            "text": "Tim mencapai performa puncak, tapi dua pemain mengalami cedera. MIND terpaksa bermain dengan formasi yang tidak optimal dan kalah di babak perempat final.",
            "end": true,
            "win": false
          },
          "recruit_new_player": {
            "text": "Anda merekrut pemain berbakat, tapi dia kesulitan beradaptasi dengan strategi tim. Beberapa anggota lama merasa terancam posisinya.",
            "options": [
              {"text": "Fokus pada team building", "next": "team_building"},
              {"text": "Beri waktu adaptasi pada pemain baru", "next": "give_adaptation_time"},
              {"text": "Rotasi pemain untuk mencari kombinasi terbaik", "next": "player_rotation"}
            ]
          },
          "team_building": {
            "text": "Kegiatan team building meningkatkan kekompakan, tapi mengurangi waktu latihan. Tim MIND bermain bagus tapi kurang konsisten, finish di posisi 6.",
            "end": true,
            "win": false
          },
          "give_adaptation_time": {
            "text": "Pemain baru mulai beradaptasi, tapi proses ini lambat. Turnamen sudah dimulai sebelum tim menemukan ritme yang tepat. MIND tersingkir di babak playoff.",
            "end": true,
            "win": false
          },
          "player_rotation": {
            "text": "Rotasi memberi insight baru tentang kekuatan tim, tapi mengorbankan sinergi. MIND bermain tidak stabil dan gagal lolos ke playoff.",
            "end": true,
            "win": false
          },
          "analyze_top_teams": {
            "text": "Analisis menunjukkan bahwa meta game saat ini didominasi strategi early aggression. Tim Anda lebih nyaman dengan late game. Apa yang akan Anda lakukan?",
            "options": [
              {"text": "Adaptasi ke meta early aggression", "next": "adapt_to_meta"},
              {"text": "Sempurnakan strategi late game", "next": "perfect_late_game"},
              {"text": "Kembangkan counter-strategy", "next": "develop_counter"}
            ]
          },
          "adapt_to_meta": {
            "text": "Tim berusaha beradaptasi dengan strategi early aggression. Hasilnya beragam, beberapa pemain merasa tidak nyaman. MIND finish di posisi tengah klasemen.",
            "end": true,
            "win": false
          },
          "perfect_late_game": {
            "text": "Strategi late game yang sempurna membuat MIND menjadi dark horse turnamen. Tim mencapai final tapi kalah tipis dari juara bertahan.",
            "end": true,
            "win": false
          },
          "develop_counter": {
            "text": "Counter-strategy berhasil mengejutkan tim-tim top. MIND menjadi sensasi turnamen dan memenangkan MPL ID!",
            "end": true,
            "win": false
          }
        }
      },
      {
        "id": "trapped_in_minecraft",
        "title": "Terjebak di Dunia Kubus: Petualangan Minecraft",
        "start": {
          "text": "Anda adalah Steve, seorang gamer biasa yang tiba-tiba terbangun di dunia Minecraft. Di sekitar Anda hanya ada pohon dan padang rumput sejauh mata memandang. Hari mulai gelap dan Anda mendengar suara monster di kejauhan. Apa yang Anda lakukan?",
          "options": [
            {"text": "Mulai menebang pohon untuk kayu", "next": "gather_wood"},
            {"text": "Cari gua untuk berlindung", "next": "find_cave"},
            {"text": "Buat alat sederhana dari batu", "next": "craft_stone_tools"}
          ]
        },
        "nodes": {
          "gather_wood": {
            "text": "Anda berhasil mengumpulkan beberapa kayu. Malam semakin dekat dan Anda melihat zombie di kejauhan.",
            "options": [
              {"text": "Buat rumah kayu sederhana", "next": "build_wooden_house"},
              {"text": "Buat obor dan jelajahi area", "next": "craft_torch_explore"},
              {"text": "Naik ke atas pohon untuk keamanan", "next": "climb_tree"}
            ]
          },
          "build_wooden_house": {
            "text": "Anda berhasil membangun rumah kayu kecil tepat sebelum malam tiba. Dari dalam, Anda mendengar monster di luar, tapi Anda aman sampai pagi.",
            "end": true,
            "win": false
          },
          "craft_torch_explore": {
            "text": "Dengan obor di tangan, Anda menjelajahi area. Anda menemukan sebuah desa NPC dan berhasil mencapai keamanan untuk malam itu.",
            "end": true,
            "win": false
          },
          "climb_tree": {
            "text": "Anda naik ke atas pohon, tapi seorang skeleton melihat Anda dan mulai menembakkan panah. Anda terjatuh dan terluka parah.",
            "end": true,
            "win": false
          },
          "find_cave": {
            "text": "Anda menemukan gua kecil. Di dalam gelap, tapi Anda mendengar suara air mengalir dan melihat kilau batu bara.",
            "options": [
              {"text": "Tambang batu bara untuk penerangan", "next": "mine_coal"},
              {"text": "Ikuti suara air", "next": "follow_water_sound"},
              {"text": "Tutup pintu masuk gua untuk keamanan", "next": "seal_cave_entrance"}
            ]
          },
          "mine_coal": {
            "text": "Anda berhasil menambang beberapa batu bara dan membuat obor. Gua menjadi terang, dan Anda menemukan deposit berlian! Anda telah membuat awal yang sempurna di dunia Minecraft.",
            "end": true,
            "win": true
          },
          "follow_water_sound": {
            "text": "Anda mengikuti suara air dan menemukan sungai bawah tanah. Sayangnya, Anda terpeleset dan hanyut ke dalam kegelapan.",
            "end": true,
            "win": false
          },
          "seal_cave_entrance": {
            "text": "Anda menutup pintu masuk gua, tapi terjebak dalam kegelapan total. Tanpa sumber makanan atau cahaya, situasi Anda semakin memburuk.",
            "end": true,
            "win": false
          },
          "craft_stone_tools": {
            "text": "Anda membuat kapak dan sekop batu. Dengan alat baru, Anda merasa lebih siap. Tiba-tiba, Anda melihat sebuah desa di kejauhan.",
            "options": [
              {"text": "Pergi ke desa", "next": "go_to_village"},
              {"text": "Gali lubang dan bersembunyi sampai pagi", "next": "dig_hole_hide"},
              {"text": "Mulai membangun rumah dengan alat baru", "next": "build_house_new_tools"}
            ]
          },
          "go_to_village": {
            "text": "Anda tiba di desa, tapi penduduk desa tidak ramah pada orang asing. Mereka mengusir Anda dan Anda terpaksa menghabiskan malam di luar, melawan monster.",
            "end": true,
            "win": false
          },
          "dig_hole_hide": {
            "text": "Anda menggali lubang untuk bersembunyi, tapi tanah di atasnya runtuh. Anda terjebak dan kehabisan oksigen.",
            "end": true,
            "win": false
          },
          "build_house_new_tools": {
            "text": "Dengan alat baru, Anda membangun rumah yang kokoh. Malam berlalu dengan aman, dan pagi harinya Anda siap untuk petualangan lebih lanjut.",
            "end": true,
            "win": false
          }
        }
      },
      {
        "id": "graveyard_pirates_journey",
        "title": "Graveyard Pirates: Menuju Takhta Raja Bajak Laut",
        "start": {
          "text": "Anda adalah kapten Graveyard Pirates, sebuah kru bajak laut yang bercita-cita menjadi Raja Bajak Laut. Kapal Anda baru saja memasuki Grand Line, lautan paling berbahaya di dunia. Apa langkah pertama Anda dalam petualangan ini?",
          "options": [
            {"text": "Cari informasi tentang Poneglyph pertama", "next": "search_poneglyph"},
            {"text": "Rekrut anggota kru baru di pulau terdekat", "next": "recruit_crew"},
            {"text": "Tantang salah satu Yonko untuk membangun reputasi", "next": "challenge_yonko"}
          ]
        },
        "nodes": {
          "search_poneglyph": {
            "text": "Anda mendengar rumor tentang Poneglyph di sebuah pulau terpencil. Namun, pulau tersebut dijaga oleh Angkatan Laut.",
            "options": [
              {"text": "Menyusup diam-diam ke pulau", "next": "infiltrate_island"},
              {"text": "Negosiasi dengan penduduk lokal untuk bantuan", "next": "negotiate_locals"},
              {"text": "Serang pangkalan Angkatan Laut secara langsung", "next": "attack_navy"}
            ]
          },
          "infiltrate_island": {
            "text": "Anda berhasil menyusup dan menemukan Poneglyph. Informasi yang Anda dapatkan membawa Anda selangkah lebih dekat untuk menjadi Raja Bajak Laut!",
            "end": true,
            "win": true
          },
          "negotiate_locals": {
            "text": "Penduduk lokal menolak membantu dan melaporkan keberadaan Anda ke Angkatan Laut. Anda terpaksa melarikan diri tanpa informasi apapun.",
            "end": true,
            "win": false
          },
          "attack_navy": {
            "text": "Serangan langsung terhadap Angkatan Laut terlalu beresiko. Kru Anda mengalami kekalahan besar dan Anda ditangkap.",
            "end": true,
            "win": false
          },
          "recruit_crew": {
            "text": "Di pulau terdekat, Anda menemukan tiga calon potensial: seorang navigator berbakat, seorang koki jenius, dan seorang penembak jitu.",
            "options": [
              {"text": "Rekrut navigator", "next": "recruit_navigator"},
              {"text": "Rekrut koki", "next": "recruit_cook"},
              {"text": "Rekrut penembak jitu", "next": "recruit_sniper"}
            ]
          },
          "recruit_navigator": {
            "text": "Navigator baru memimpin Anda ke sebuah pulau tersembunyi. Di sana, Anda menemukan harta karun biasa yang meningkatkan dana kru, tapi tidak membawa Anda lebih dekat ke tujuan.",
            "end": true,
            "win": false
          },
          "recruit_cook": {
            "text": "Koki baru membuat makanan yang meningkatkan stamina kru. Energi berlimpah, tapi persediaan bahan makanan menipis cepat. Anda terpaksa kembali ke pelabuhan untuk mengisi ulang persediaan.",
            "end": true,
            "win": false
          },
          "recruit_sniper": {
            "text": "Penembak jitu membantu Anda mengalahkan kru bajak laut saingan. Bounty Anda meningkat, menarik perhatian Pemburu Bajak Laut yang kuat. Anda kalah dalam pertempuran melawan mereka.",
            "end": true,
            "win": false
          },
          "challenge_yonko": {
            "text": "Anda menantang salah satu Yonko, tapi ternyata kekuatan Anda masih jauh di bawahnya. Yonko memberi Anda pilihan.",
            "options": [
              {"text": "Bergabung dengan aliansi Yonko", "next": "join_yonko_alliance"},
              {"text": "Kabur dan berlatih lebih keras", "next": "flee_and_train"},
              {"text": "Berjuang sampai akhir meski kalah", "next": "fight_to_end"}
            ]
          },
          "join_yonko_alliance": {
            "text": "Anda bergabung dengan aliansi Yonko. Meski bukan jalan yang Anda rencanakan, ini membuka peluang besar untuk pertumbuhan kru Anda. Namun, impian menjadi Raja Bajak Laut harus ditunda.",
            "end": true,
            "win": false
          },
          "flee_and_train": {
            "text": "Anda melarikan diri dan berlatih di sebuah pulau tersembunyi. Kekuatan kru meningkat, tapi Anda kehilangan banyak waktu dan kesempatan.",
            "end": true,
            "win": false
          },
          "fight_to_end": {
            "text": "Keberanian Anda menghadapi Yonko menyebar ke seluruh Grand Line. Meski kalah, reputasi Anda meningkat pesat! Namun, kru Anda mengalami kekalahan berat dan butuh waktu lama untuk pulih.",
            "end": true,
            "win": false
          }
        }
      }
]